# Описание Итогового Проекта

Задача Проекта: Написать программу, которая из имеющегося массива строк сформирует новый массив из строк, длина которых меньше, либо равна 3 символам.

Данный Проект можно разделить на три этапа

* Ввод данных

* Обработка данных и создание нового массива

* Вывод данных

## Ввод данных

Ввод данных осуществляется с помощью команды "Console.ReadLine()", где просим пользователя ввести набор символов или слов через пробел, после чего все данные помещаем в переменную "str". Переменная  str имеет строковый тип. На данном этапе необходимо сделать проверку на наличие данных в переменной str. С помощью условия "if (str != "")" проверяем наличие символов в нашей переменной. При выполнении данного условия переходим к следующему этапу.

## Обработка данных и создание нового массива

На данном этапе мы имеем пременную str с символами введенными через пробел и с помощью "str.Split(' ')", где сепаратором в данной команде является пробел, создаем массив элементов и помещаем его в "Array". 

Согласно заданию, требуется создать новый массив, куда будем добавлять элементы  длина которых, меньше, либо равна 3 символам. Для этого объявляем массив "newArray" и пременную "j = 0", которая будет являться индексом данного массива.

Теперь все готово к следующему шагу, где с помощью цикла "foreach (var value in Array)" будем проверять каждый элемент массива "Array" на условие, количесто символом содержащихся в этом элементе менее четырех "if (value.Length < 4)", где свойство Length определит количество символов в элементе массива. И если элемент соответствует нашему условию, помещаем его в новый массив с соответсвующим индексом "j", после чего "j++" увеличиваем на 1. 

После проверки всех элементов массива "Array" сформируется новый массив "newArray" и можно переходить к следующему этапу.

## Вывод данных

На данном этапе производится вывод данных, который будет соответствовать разным условия. 
 - На начальном этапе, если пользователь оставит строку пустой программа не будет выполнена и укажет на это с помощью команды "Console.WriteLine("Нужно было, что-то написать!")".
 - Если пользователь ввел все элементы с количеством символов более трех, программа укажет на это, выведя соответствующие сообщение "В данном массиве отсутствуют требуемые элементы!".
 - А если новый массив "newArray" наполнен искомыми элементами, то с помощью метода "PrintArray", будет выведен в консоль весь массив. Что и будет являться ответом поставленной задачи.

# Заключение

Кроме описательной части в проекте представлен программный код, содержащийся в файле Program.cs.
Логическое решение данной задачи представлено в файле Blog.drawio